//==================================================================================
// 
// デバッグプロシージャクラスのソースファイル [debugproc.cpp]
// Author : TENMA SAITO
// Date   : 2026/5/17
// 
//==================================================================================
//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "debugproc.h"
#include "manager.h"
#include "renderer.h"
#include <stdio.h>

//==================================================================================
// --- コンストラクタ ---
//==================================================================================
CDebugProc::CDebugProc()
{
	// 各メンバ変数のクリア
	m_pFont = NULL;
	m_pString = NULL;
	m_colFont = D3DXCOLOR(1, 1, 1, 1);
}

//==================================================================================
// --- デストラクタ ---
//==================================================================================
CDebugProc::~CDebugProc()
{
}

//==================================================================================
// --- 初期化処理 ---
//==================================================================================
HRESULT CDebugProc::Init(const UINT &rHeight, const char *pFontname)
{
	LPDIRECT3DDEVICE9 pDevice = NULL;		// デバイスへのポインタ
	HRESULT hr = S_OK;		// 処理の結果

	// デバイスの取得
	pDevice = CManager::GetDeviceByInstance();

	if (m_pFont == NULL)
	{ // フォントが作成されていなければ作成
		// フォントの作成
		hr = D3DXCreateFont(pDevice, rHeight, 0, 0, 0, FALSE, SHIFTJIS_CHARSET,
			OUT_DEFAULT_PRECIS, DEFAULT_QUALITY, DEFAULT_PITCH, pFontname, &m_pFont);
		if (FAILED(hr) || m_pFont == NULL)
		{ // フォント作成失敗
			return E_FAIL;
		}
	}

	if (m_pString == NULL)
	{ // 文字列バッファが作成されていなければ
		// 文字列バッファを確保
		m_pString = new char[MAX_STRING];
		if (m_pString == NULL)
		{ // バッファの確保失敗
			return E_FAIL;
		}

		// NULL文字を追加
		m_pString[0] = '\0';
	}

	// 初期化成功
	return S_OK;
}

//==================================================================================
// --- 終了処理 ---
//==================================================================================
void CDebugProc::Uninit(void)
{
	// フォントの破棄
	SafeRelease(m_pFont);

	// 文字列の破棄
	if (m_pString != NULL)
	{ // 文字列が生成されている場合、解放
		delete[] m_pString;
		m_pString = NULL;
	}
}

//==================================================================================
// --- 更新処理 ---
//==================================================================================
void CDebugProc::Update(void)
{ // 文字列をクリア
	strcpy(m_pString, "");
}

//==================================================================================
// --- 描画処理 ---
//==================================================================================
void CDebugProc::Draw(void)
{
#ifdef _DEBUG
	RECT rect = { 0,0,SCREEN_WIDTH,SCREEN_HEIGHT };			// 画面サイズ

	// デバッグ表示
	m_pFont->DrawText(NULL, m_pString, -1, &rect, DT_LEFT, m_colFont);
#endif
}

//==================================================================================
// --- デバッグ表示の追加処理 ---
//==================================================================================
void CDebugProc::Print(const char *pFmt, ...)
{
	char aStr[256];			// 一時的な文字列へのポインタ
	va_list arg = NULL;		// 可変長引数へのポインタ

	// 可変長引数の取得
	va_start(arg, pFmt);

	// 文字列への変換
	vsprintf(aStr, pFmt, arg);

	// 文字列を追加
	strcat(m_pString, aStr);
}