//==================================================================================
// 
// デバッグプロシージャクラスのソースファイル [debugproc.cpp]
// Author : TENMA SAITO
// Date   : 2026/5/17
// 
//==================================================================================
//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "debugproc.h"
#include "manager.h"
#include "renderer.h"
#include <stdio.h>

//==================================================================================
// --- コンストラクタ ---
//==================================================================================
CDebugProc::CDebugProc()
{ // 各メンバ変数のクリア
	m_sProc.reserve(DEFAULT_STRING_CAPACITY);
	m_pFont = NULL;
	m_colFont = D3DXCOLOR(1, 1, 1, 1);
}

//==================================================================================
// --- デストラクタ ---
//==================================================================================
CDebugProc::~CDebugProc()
{
}

//==================================================================================
// --- 初期化処理 ---
//==================================================================================
HRESULT CDebugProc::Init(const UINT &rHeight, const char *pFontname)
{
	LPDIRECT3DDEVICE9 pDevice = NULL;		// デバイスへのポインタ
	HRESULT hr = S_OK;		// 処理の結果

	// デバイスの取得
	pDevice = CManager::GetDeviceByInstance();

	if (m_pFont == NULL)
	{ // フォントが作成されていなければ作成
		// フォントの作成
		hr = D3DXCreateFont(pDevice, rHeight, 0, 0, 0, FALSE, SHIFTJIS_CHARSET,
			OUT_DEFAULT_PRECIS, DEFAULT_QUALITY, DEFAULT_PITCH, pFontname, &m_pFont);
		if (FAILED(hr) || m_pFont == NULL)
		{ // フォント作成失敗
			return E_FAIL;
		}
	}

	// 初期化成功
	return S_OK;
}

//==================================================================================
// --- 終了処理 ---
//==================================================================================
void CDebugProc::Uninit(void)
{
	// フォントの破棄
	SafeRelease(m_pFont);

	// 文字列の破棄
	m_sProc.clear();
}

//==================================================================================
// --- 更新処理 ---
//==================================================================================
void CDebugProc::Update(void)
{ // 文字列をクリア
	m_sProc.clear();
}

//==================================================================================
// --- 描画処理 ---
//==================================================================================
void CDebugProc::Draw(void)
{
#ifdef _DEBUG
	RECT rect = { 0,0,SCREEN_WIDTH,SCREEN_HEIGHT };			// 画面サイズ

	// デバッグ表示
	m_pFont->DrawText(NULL, m_sProc.c_str(), -1, &rect, DT_LEFT, m_colFont);
#endif
}