//==================================================================================
// 
// デバッグクラスのヘッダーファイル [debug.h]
// Author : TENMA SAITO
// Date   : 2026/7/3
// 
//==================================================================================
#ifndef _VEC3MATH_H_
#define _VEC3MATH_H_

//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "main.h"
#include <string>
#include <sstream>
#include <iostream>

//**********************************************************************************
// *** デバッグクラス ***
//**********************************************************************************
class CDebug
{
public:
	CDebug() {}
	~CDebug() {}

	template<class T> static void Log(const T &message);
};

//==================================================================================
// --- ログの出力処理 ---
//==================================================================================
template<class T> void CDebug::Log(const T &message)
{
	std::string str = "Debug::Log >>> ";			// ログ用文字列
	std::stringstream ss;			// 文字列のストリーム
	std::streambuf *pDefBuff;		// 元の出力ストリーム

	// 出力ストリーム先を文字列へ変更
	pDefBuff = std::cout.rdbuf(ss.rdbuf());

	// 変数を入力
	std::cout << message << std::endl;

	// 文字列を代入
	str += ss.str();

	// 出力ストリーム先を元に戻す
	std::cout.rdbuf(pDefBuff);

	// デバッグ出力
	OutputDebugString(str.c_str());
}
#endif