//==================================================================================
// 
// DirectXクラスのヘッダーファイル [directX.h]
// Author : TENMA SAITO
// Date   : 2026/5/12
// 
//==================================================================================
#ifndef _DIRECTX_H_		// インクルードガード
#define _DIRECTX_H_

//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "main.h"
#include <atomic>

//**********************************************************************************
// *** DirectXクラス ***
//**********************************************************************************
class CDirectX
{
public:
	CDirectX();
	~CDirectX();

	void DirectXProc(HINSTANCE hInstance, HWND hWnd, BOOL bWindowed);
	void Quit(void);

private:
	std::atomic_bool m_bThreadLoop;		// スレッドループフラグ
};
#endif