//==================================================================================
// 
// DirectXクラスのヘッダーファイル [directX.h]
// Author : TENMA SAITO
// Date   : 2026/5/12
// 
//==================================================================================
#ifndef _DIRECTX_H_		// インクルードガード
#define _DIRECTX_H_

//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "main.h"
#include <atomic>

//**********************************************************************************
// *** マクロ定義 ***
//**********************************************************************************
#define UPDATE_FRAMERATE		(60)		// Updateの呼び出されるフレーム数

//**********************************************************************************
// *** DirectXクラス ***
//**********************************************************************************
class CDirectX
{
public:
	CDirectX();
	~CDirectX();

	void DirectXProc(HINSTANCE hInstance, HWND hWnd, BOOL bWindowed);
	void Quit(void);
	std::atomic_bool *IsComplete(void) { return &m_bComplete; }

private:
	std::atomic_bool m_bThreadLoop;		// スレッドループフラグ
	std::atomic_bool m_bComplete;		// DirectXのスレッド終了の完了フラグ
};
#endif