//==================================================================================
// 
// DirectXクラスのヘッダーファイル [directX.h]
// Author : TENMA SAITO
// Date   : 2026/5/12
// 
//==================================================================================
#ifndef _DIRECTX_H_		// インクルードガード
#define _DIRECTX_H_

//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "main.h"
#include <atomic>

//**********************************************************************************
// *** マクロ定義 ***
//**********************************************************************************
#define WM_SUCCEEDED_INIT		(WM_USER + 1)		// 初期化が正常に終了した際に送信するコード
#define WM_FAILED_INIT			(WM_USER + 2)		// 初期化が失敗した際に送信するコード

//**********************************************************************************
// *** DirectXクラス ***
//**********************************************************************************
class CDirectX
{
public:
	CDirectX();
	~CDirectX();

	void DirectXProc(HINSTANCE hInstance, HWND hWnd, BOOL bWindowed, int nCmdShow);
	void Quit(void);

private:
	std::atomic_bool m_bThreadLoop;		// スレッドループフラグ
};
#endif