//==================================================================================
// 
// エディットクラスのヘッダーファイル [edit.h]
// Author : TENMA SAITO
// Date   : 2026/9/2
// 
//==================================================================================
#ifndef _EDIT_H_		// インクルードガード
#define _EDIT_H_

//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "scene.h"

//**********************************************************************************
// *** 前方宣言 ***
//**********************************************************************************
class CPlayer;
class CCombo;
class CConnectingEvaluate;
class CThunderCamera;

//**********************************************************************************
// *** チュートリアルクラス ***
//**********************************************************************************
class CEdit : public CSceneBase<CEdit, CScene::MODE_EDIT>
{
public:
	CEdit();
	~CEdit();

	HRESULT Init(void) override;
	void Uninit(void) override;
	void Update(void) override;
	void Draw(void) override;

private:
	void Start(void);
	void Print(void);
	void MapEdit(void);

	CPlayer *m_pPlayer;		// プレイヤーへのポインタ
};
#endif