//==================================================================================
// 
// ゲームクリアクラスのソースファイル [gameclear.cpp]
// Author : TENMA SAITO
// Date   : 2026/7/14
// 
//==================================================================================
//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "gameclear.h"
#include "object.h"
#include "manager.h"
#include "renderer.h"
#include "camera.h"
#include "input.h"
#include "joypad.h"
#include "texture.h"
#include "object2D.h"
#include "camera.h"

//**********************************************************************************
// *** マクロ定義 ***
//**********************************************************************************
#define LOGO_POSITION		D3DXVECTOR3(WINDOW_MIDDLE.x, 200.0f, 0.0f)		// ロゴの位置
#define LOGO_SIZE			D3DXVECTOR2(800.0f, 200.0f)			// ロゴのサイズ
#define LOGO_FILEPATH		"data/TEXTURE/gameclearlogo.png"	// ロゴテクスチャへのパス

//==================================================================================
// --- コンストラクタ ---
//==================================================================================
CGameClear::CGameClear() : CScene(MODE_TITLE)
{ // 親クラスのコンストラクタ呼び出し
	m_pLogo = nullptr;
}

//==================================================================================
// --- デストラクタ ---
//==================================================================================
CGameClear::~CGameClear()
{
}

//==================================================================================
// --- 初期化処理 ---
//==================================================================================
HRESULT CGameClear::Init(void)
{ // 開始処理
	Start();

	return S_OK;
}

//==================================================================================
// --- 終了処理 ---
//==================================================================================
void CGameClear::Uninit(void)
{
}

//==================================================================================
// --- 更新処理 ---
//==================================================================================
void CGameClear::Update(void)
{
	CManager *pManager = CManager::GetInstance();		// マネージャへのポインタ
	CInputKeyboard *pKeyboard = pManager->GetInputKeyboard();		// キーボードへのポインタ
	CJoypad *pJoypad = pManager->GetJoypad();			// ジョイパッドへのポインタ

	if (pKeyboard->GetTrigger(DIK_RETURN) || pJoypad->GetTrigger(CJoypad::KEY_A))
	{ // シーン遷移
		pManager->SetTransition(CScene::MODE_TITLE);
	}

	// 全カメラの更新処理
	CCamera::UpdateAll();
}

//==================================================================================
// --- 描画処理 ---
//==================================================================================
void CGameClear::Draw(void)
{
}

//==================================================================================
// --- 初期化後呼び出し処理 ---
//==================================================================================
void CGameClear::Start(void)
{
	// ロゴ生成
	m_pLogo = CObject2D::Create(LOGO_POSITION, LOGO_SIZE);
	m_pLogo->BindTexture(CTexture::GetInstance()->Register(LOGO_FILEPATH));

	// 仮置きでカメラを生成 (自動解放)
	// TODO : ここのカメラはゲームオーバー用のカメラを作って置き換える事！
	CCamera *pCamera = new CCamera(CCamera::TYPE_GAMEOVER);
	pCamera->Init(D3DXVECTOR3(0.0f, 0.0f, -100.0f));
	pCamera->SetFocus();
}