//==================================================================================
// 
// ゲームクリアクラスのヘッダーファイル [gameclear.h]
// Author : TENMA SAITO
// Date   : 2026/7/14
// 
//==================================================================================
#ifndef _GAMECLEAR_H_		// インクルードガード
#define _GAMECLEAR_H_

//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "scene.h"

//**********************************************************************************
// *** 前方宣言 ***
//**********************************************************************************
class CObject2D;

//**********************************************************************************
// *** タイトルクラス ***
//**********************************************************************************
class CGameClear : public CScene
{
public:
	CGameClear();
	~CGameClear();

	HRESULT Init(void) override;
	void Uninit(void) override;
	void Update(void) override;
	void Draw(void) override;
	CObject2D *GetLogo(void) const { return m_pLogo; }

	static constexpr MODE GetMyMode(void) { return CScene::MODE_GAMECLEAR; }

private:
	void Start(void);

	CObject2D *m_pLogo;		// ゲームオーバーロゴ
};
#endif