//==================================================================================
// 
// ゲームオーバークラスのヘッダーファイル [gameover.h]
// Author : TENMA SAITO
// Date   : 2026/7/14
// 
//==================================================================================
#ifndef _GAMEOVER_H_		// インクルードガード
#define _GAMEOVER_H_

//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "scene.h"

//**********************************************************************************
// *** 前方宣言 ***
//**********************************************************************************
class CObject2D;

//**********************************************************************************
// *** タイトルクラス ***
//**********************************************************************************
class CGameOver : public CScene
{
public:
	CGameOver();
	~CGameOver();

	HRESULT Init(void) override;
	void Uninit(void) override;
	void Update(void) override;
	void Draw(void) override;
	CObject2D *GetLogo(void) const { return m_pLogo; }

private:
	void Start(void);

	CObject2D *m_pLogo;		// ゲームオーバーロゴ
};
#endif