//==================================================================================
// 
// インスタンシングモデルクラスのヘッダーファイル [instancingModel.h]
// Author : TENMA SAITO
// Date   : 2026/7/3
// 
//==================================================================================
#ifndef _INSTANCINGMODEL_H_		// インクルードガード
#define _INSTANCINGMODEL_H_

//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "main.h"
#include <list>

//**********************************************************************************
// *** マクロ定義 ***
//**********************************************************************************
#define DEFAULT_INSTANSING_NUM			(100)		// デフォルトの最大描画数

//**********************************************************************************
// *** オブジェクトX(インスタンシング)クラス ***
//**********************************************************************************
class CInstancingModel
{
public:
	using Where = std::list<const Matrix*>::const_iterator;

	// モデルデータ構造体
	struct Data
	{
		LPD3DXMESH pMesh;		// メッシュへのポインタ
		LPD3DXBUFFER pMat;		// マテリアルへのポインタ
		DWORD dwNumMat;			// マテリアルの数
		int *pIdx;				// テクスチャインデックスへのポインタ
		std::list<const Matrix*> apMtxWorld;		// 描画するオブジェクトのマトリックスへのポインタ
	};

	Where Resister(const Matrix *pMtxWorld);
	void Remove(const Where iter);

private:
	std::list<Data> m_data;		// モデルデータ
};
#endif