//==================================================================================
// 
// マップクラスのヘッダーファイル [map.h]
// Author : TENMA SAITO
// Date   : 2026/6/22
// 
//==================================================================================
#ifndef _MAP_H_		// インクルードガード
#define _MAP_H_

//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "main.h"
#include <string_view>
#include <vector>

//**********************************************************************************
// *** マクロ定義 ***
//**********************************************************************************
#define MAX_PATH_LEN		(260)		// 代入可能な文字列の長さ

//**********************************************************************************
// *** マップクラス ***
//**********************************************************************************
class CMap
{
public:
	// 出力する情報
	struct IODATA;

	CMap();
	~CMap();

	void AddUtilityPole(const Vector3 &pos);
	void AddBulding(const int nType, const Vector3 &pos);
	void AddPowerPlant(const Vector3 &pos);
	void Save(std::string_view sMapFile);
	void Load(std::string_view sMapFile);
	void LoadLatest(void);
	static CMap *GetInstance(void);
};
#endif