//==================================================================================
// 
// メッシュ2Dクラスのヘッダーファイル [mesh2D.h]
// Author : TENMA SAITO
// Date   : 2026/5/30
// 
//==================================================================================
#ifndef _MESH2D_H_
#define _MESH2D_H_

//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "mesh.h"

//**********************************************************************************
// *** マクロ定義 ***
//**********************************************************************************

//**********************************************************************************
// *** メッシュ2Dクラス ***
//**********************************************************************************
class CMesh2D : public CMesh
{
public:
	static CMesh2D *Create(const int nNumVtx, const int nNumIdx, const int nNumPrim);

	CMesh2D();
	~CMesh2D();

	HRESULT Init(const int nNumVtx, const int nNumIdx, const int nNumPrim, const size_t vtxSize, const DWORD nFlags) override;
	void Uninit(void) override;
	void Update(void) override;
	void Draw(void) override;

private:
};
#endif