//==================================================================================
// 
// メッシュ3Dクラスのヘッダーファイル [mesh3D.h]
// Author : TENMA SAITO
// Date   : 2026/5/30
// 
//==================================================================================
#ifndef _MESH3D_H_
#define _MESH3D_H_

//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "mesh.h"

//**********************************************************************************
// *** マクロ定義 ***
//**********************************************************************************

//**********************************************************************************
// *** メッシュ3Dクラス ***
//**********************************************************************************
class CMesh3D : public CMesh
{
public:
	CMesh3D *Create(const int nNumVtx, const int nNumIdx, const int nNumPrim);

	CMesh3D(const int nPriority = DEFAULT_OBJ_PRIORITY);
	~CMesh3D();

	HRESULT Init(const int nNumVtx, const int nNumIdx, const int nNumPrim);
	void Uninit(void);
	void Update(void);
	void Draw(void);

private:
};
#endif