//==================================================================================
// 
// ランダムクラスのソースファイル [rand.cpp]
// Author : TENMA SAITO
// Date   : 2026/5/25
// 
//==================================================================================
//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "rand.h"
#include <random>

//==================================================================================
// --- インスタンス取得処理 ---
//==================================================================================
CRand *CRand::GetInstance(void)
{
	static CRand instance;

	return &instance;
}

//==================================================================================
// --- char型乱数取得処理 ---
//==================================================================================
char CRand::Generate(const char cMin, const char cMax)
{
	static std::mt19937 engine(m_nSeed);		// 乱数生成器

	// charの範囲を指定
	std::uniform_int_distribution<int> dist(cMin, cMax);

	// 乱数を生成し、返す
	return dist(engine);
}

//==================================================================================
// --- int型乱数取得処理 ---
//==================================================================================
int CRand::Generate(const int nMin, const int nMax)
{
	static std::mt19937 engine(m_nSeed);		// 乱数生成器

	// intの範囲を指定
	std::uniform_int_distribution<int> dist(nMin, nMax);

	// 乱数を生成し、返す
	return dist(engine);
}

//==================================================================================
// --- float型乱数取得処理 ---
//==================================================================================
float CRand::Generate(const float fMin, const float fMax)
{
	static std::mt19937 engine(m_nSeed);		// 乱数生成器

	// floatの範囲を指定
	std::uniform_real_distribution<float> dist(fMin, fMax);

	// 乱数を生成し、返す
	return dist(engine);
}

//==================================================================================
// --- double型乱数取得処理 ---
//==================================================================================
double CRand::Generate(const double dMin, const double dMax)
{
	static std::mt19937 engine(m_nSeed);		// 乱数生成器

	// doubleの範囲を指定
	std::uniform_real_distribution<double> dist(dMin, dMax);

	// 乱数を生成し、返す
	return dist(engine);
}

//==================================================================================
// --- コンストラクタ ---
//==================================================================================
CRand::CRand()
{
	std::random_device randDevice;		// 非決定論的な乱数生成器

	// 乱数の種を生成
	m_nSeed = randDevice();
}

//==================================================================================
// --- デストラクタ ---
//==================================================================================
CRand::~CRand()
{
}