//==================================================================================
// 
// 光線クラスのソースファイル [ray.cpp]
// Author : TENMA SAITO
// Date   : 2026/7/17
// 
//==================================================================================
//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "ray.h"
#include "objectLine.h"
#include "vec3math.h"

//==================================================================================
// --- コンストラクタ ---
//==================================================================================
CRay::CRay()
{ // メンバ変数のクリア
	m_start = VECTOR3_NULL;
	m_end = VECTOR3_NULL;
	m_vec = VECTOR3_NULL;
	m_fLength = 0.0f;
}

//==================================================================================
// --- コンストラクタ (始点と方向ベクトルと長さを指定) ---
//==================================================================================
CRay::CRay(const Vector3 &start, const Vector3 &vec, const float fLength)
{ // 引数を保存
	m_start = start;
	m_vec = vec;
	m_fLength = fLength;

	// 引数から終点を計算
	m_end = m_start + (m_vec * m_fLength);
}

//==================================================================================
// --- コンストラクタ (始点と終点指定) ---
//==================================================================================
CRay::CRay(const Vector3 &start = VECTOR3_NULL, const Vector3 &end = VECTOR3_NULL)
{ // 引数を保存
	m_start = start;
	m_end = end;

	// 方向ベクトルと長さを計算
	m_vec = Vec3::Direction(end, start);
	m_fLength = Vec3::Length(end, start);
}

//==================================================================================
// --- デストラクタ ---
//==================================================================================
CRay::~CRay()
{
}

//==================================================================================
// --- レイの描画処理 ---
//==================================================================================
void CRay::Draw(const int nFrame)
{ // フレーム数 + 1で生成 (1のままだと、Updateで減少して即死する)
#ifdef _DEBUG
	CObjectLine::Create(m_start, m_end)->SetLife(nFrame + 1);
#endif
}

//==================================================================================
// --- 始点設定処理 ---
//==================================================================================
void CRay::SetStart(const Vector3 &start)
{ // 引数保存
	m_start = start;

	// 方向ベクトルと長さを計算
	m_vec = Vec3::Direction(m_end, start);
	m_fLength = Vec3::Length(m_end, start);
}

//==================================================================================
// --- 終点設定処理 ---
//==================================================================================
void CRay::SetEnd(const Vector3 &end)
{ // 引数保存
	m_end = end;

	// 方向ベクトルと長さを計算
	m_vec = Vec3::Direction(end, m_start);
	m_fLength = Vec3::Length(end, m_start);
}

//==================================================================================
// --- 方向ベクトル設定処理 ---
//==================================================================================
void CRay::SetVector(const Vector3 &vec)
{ // 引数保存
	m_vec = vec;

	// 終点を計算
	m_end = m_start + (vec * m_fLength);
}

//==================================================================================
// --- ベクトルの長さ設定処理 ---
//==================================================================================
void CRay::SetLength(const float fLength)
{ // 引数保存
	m_fLength = fLength;

	// 終点を計算
	m_end = m_start + (m_vec * fLength);
}