//==================================================================================
// 
// テクスチャクラスのヘッダーファイル [texture.h]
// Author : TENMA SAITO
// Date   : 2026/6/1
// 
//==================================================================================
#ifndef _TEXTURE_H_		// インクルードガード
#define _TEXTURE_H_

//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "main.h"

//**********************************************************************************
// *** マクロ定義 ***
//**********************************************************************************
#define MAX_TEXTURE		(256)		// テクスチャの読み込める数

//**********************************************************************************
// *** テクスチャクラス ***
//**********************************************************************************
class CTexture
{
public:
	static CTexture *GetInstance(void);
	HRESULT Load(void);
	void Unload(void);
	int Register(const char *pFileName);
	LPDIRECT3DTEXTURE9 GetAddress(const int nIdx);

private:
	CTexture();
	~CTexture();

	int Load(const char *pFileName);

	LPDIRECT3DTEXTURE9 m_apTexture[MAX_TEXTURE];		// テクスチャの管理配列ポインタ
	char *m_apFileName[MAX_TEXTURE];					// 読み込んだテクスチャのファイル名
	int m_nNumAll;			// 読み込んだテクスチャの総数
};
#endif