//==================================================================================
// 
// タイトルクラスのソースファイル [title.cpp]
// Author : TENMA SAITO
// Date   : 2026/7/1
// 
//==================================================================================
//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "title.h"
#include "object.h"
#include "manager.h"
#include "renderer.h"
#include "camera.h"
#include "input.h"
#include "joypad.h"
#include "texture.h"
#include "object2D.h"
#include "camera.h"
#include "titlemenu.h"
#include "observer_pointer.h"

//**********************************************************************************
// *** マクロ定義 ***
//**********************************************************************************
#define LOGO_POSITION		Vector3(400.0f, 150.0f, 0.0f)		// ロゴの位置
#define LOGO_SIZE			Vector2(700.0f, 200.0f)		// ロゴのサイズ
#define LOGO_FILEPATH		"data/TEXTURE/titlelogo.png"	// ロゴテクスチャへのパス

//==================================================================================
// --- コンストラクタ ---
//==================================================================================
CTitle::CTitle() : CScene(MODE_TITLE)
{ // 親クラスのコンストラクタ呼び出し
	m_pLogo = nullptr;
	m_pMenu = nullptr;
}

//==================================================================================
// --- デストラクタ ---
//==================================================================================
CTitle::~CTitle()
{
}

//==================================================================================
// --- 初期化処理 ---
//==================================================================================
HRESULT CTitle::Init(void)
{
	// 開始処理
	Start();

	return S_OK;
}

//==================================================================================
// --- 終了処理 ---
//==================================================================================
void CTitle::Uninit(void)
{
}

//==================================================================================
// --- 更新処理 ---
//==================================================================================
void CTitle::Update(void)
{ // 全カメラの更新処理
	CCamera::UpdateAll();
}

//==================================================================================
// --- 描画処理 ---
//==================================================================================
void CTitle::Draw(void)
{
}

//==================================================================================
// --- 初期化後呼び出し処理 ---
//==================================================================================
void CTitle::Start(void)
{
	// 仮置きでカメラを生成 (自動解放)
	// TODO : ここのカメラはタイトル用のカメラを作って置き換える事！
	CCamera *pCamera = new CCamera(CCamera::TYPE_TITLE);
	pCamera->Init(Vector3(0.0f, 0.0f, -100.0f));
	pCamera->SetFocus();

	// タイトル画面のメニューを生成
	m_pMenu = CTitleMenu::Create();

	// ロゴ生成
	m_pLogo = CObject2D::Create(LOGO_POSITION, LOGO_SIZE);
	m_pLogo->BindTexture(CTexture::GetInstance()->Register(LOGO_FILEPATH));
}