//==================================================================================
// 
// タイトルクラスのヘッダーファイル [title.h]
// Author : TENMA SAITO
// Date   : 2026/7/1
// 
//==================================================================================
#ifndef _TITLE_H_		// インクルードガード
#define _TITLE_H_

//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "scene.h"

//**********************************************************************************
// *** 前方宣言 ***
//**********************************************************************************
class CTitleCamera;
class CObject2D;

//**********************************************************************************
// *** タイトルクラス ***
//**********************************************************************************
class CTitle : public CScene
{
public:
	CTitle();
	~CTitle();

	HRESULT Init(void) override;
	void Uninit(void) override;
	void Update(void) override;
	void Draw(void) override;
	CObject2D *GetLogo(void) const { return m_pLogo; }

private:
	void Start(void);

	CObject2D *m_pLogo;		// ロゴ
};
#endif