//==================================================================================
// 
// スコア加算がされない建物クラスのヘッダーファイル [buildingUnscorable.h]
// Author : TENMA SAITO
// Date   : 2026/8/31
// 
//==================================================================================
#ifndef _BUILDING_UNSCORABLE_H_
#define _BUILDING_UNSCORABLE_H_

//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "building.h"

//**********************************************************************************
// *** スコア加算がされない建物クラス ***
//**********************************************************************************
class CBuildingUnscorable : public CBuilding
{
public:
	CBuildingUnscorable();
	~CBuildingUnscorable();

	static CBuildingUnscorable *Create();

	HRESULT Init();

private:

};
#endif