//==================================================================================
// 
// ユーティリティ関数をまとめたソースファイル [util.cpp]
// Author : TENMA SAITO
// Date   : 2026/6/22
// 
//==================================================================================
//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "util.h"
#include <iomanip>

//==================================================================================
// --- 文字列の検索処理 ---
//==================================================================================
int Util::FindString(const char **ppStr, const int nNumString, const char *pFind)
{
	// NULLCHECK
	assert(ppStr != nullptr);

	for (int nCntString = 0; nCntString < nNumString; nCntString++)
	{ // 引数分の文字列を検査する
		if (strcmp(ppStr[nCntString], pFind) == 0)
		{ // 見つかった場合、見つかったインデックスを返す
			return nCntString;
		}
	}

	// 検索失敗
	return -1;
}

//==================================================================================
// --- 角度の修正処理 ---
//==================================================================================
float Util::FixedRotation(const float fRadian)
{
	if (fRadian > D3DX_PI)
	{ // 角度がPIを超えたとき
		return fRadian - DOUBLE_PI;
	}
	else if (fRadian <= -D3DX_PI)
	{ // 角度が-PIを以下になった時
		return fRadian + DOUBLE_PI;
	}
	else
	{ // 変更の必要なし
		return fRadian;
	}
}

//==================================================================================
// --- 線形補間処理 ---
//==================================================================================
float Util::Lerp(const float fStart, const float fEnd, const float ft)
{
	return fStart + ((fEnd - fStart) * ft);
}

//==================================================================================
// --- 小数点の精度の設定処理 ---
//==================================================================================
void Util::SetStringSetting(const int nNumPrecision)
{
	std::cout << std::fixed << std::setprecision(nNumPrecision);
}