//==================================================================================
// 
// Vector2,3の計算関連関数をまとめたソースファイル [vec2math.cpp]
// Author : TENMA SAITO
// Date   : 2026/5/16
// 
//==================================================================================
//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "vec2math.h"
#include "rand.h"

//**********************************************************************************
// *** マクロ定義 ***
//**********************************************************************************
#define SQUARE(x)		(x * x)			// 2乗
#define OX_EPSILON		(0.000001f)		// 浮動小数による判定誤差防止

//==================================================================================
// --- 2次元ベクトルの長さ取得処理 ---
//==================================================================================
float Vec2::Length(const Vector2 &vec)
{
	return sqrtf(SQUARE(vec.x) + SQUARE(vec.y));
}

//==================================================================================
// --- 2次元ベクトルの長さ取得処理 (2点間指定) ---
//==================================================================================
float Vec2::Length(const Vector2 &To, const Vector2 &From)
{
	return Length(To - From);
}

//==================================================================================
// --- 2次元ベクトルの長さの2乗取得処理 ---
//==================================================================================
float Vec2::LengthSq(const Vector2 &vec)
{
	return SQUARE(vec.x) + SQUARE(vec.y);
}

//==================================================================================
// --- 2次元ベクトルの長さの二乗取得処理 (2点間指定) ---
//==================================================================================
float Vec2::LengthSq(const Vector2 &To, const Vector2 &From)
{
	return LengthSq(To - From);
}

//==================================================================================
// --- 2次元ベクトル同士の内積処理 ---
//==================================================================================
float Vec2::Dot(const Vector2 &vec1, const Vector2 &vec2)
{
	return (vec1.x * vec2.x) + (vec1.y * vec2.y);
}

//==================================================================================
// --- 2次元ベクトル同士の外積処理 ---
//==================================================================================
float Vec2::Cross(const Vector2 &vec1, const Vector2 &vec2)
{
	return (vec1.x * vec2.y) - (vec1.y * vec2.x);
}

//==================================================================================
// --- 2次元ベクトル同士の垂直判定処理 ---
//==================================================================================
bool Vec2::IsVertical(const Vector2 &vec1, const Vector2 &vec2)
{
	float fDot;		// 内積結果

	// 2つのベクトルの内積取得
	fDot = Dot(vec1, vec2);

	// 誤差範囲内なら垂直と判定
	return (-OX_EPSILON < fDot &&fDot < OX_EPSILON);
}

//==================================================================================
// --- 2次元ベクトル同士の平行判定処理 ---
//==================================================================================
bool Vec2::IsParallel(const Vector2 &vec1, const Vector2 &vec2)
{
	float fCross;		// 外積結果

	// 2つのベクトルの外積取得
	fCross = Cross(vec1, vec2);

	// 誤差範囲内なら平行と判定
	return (-OX_EPSILON < fCross &&fCross < OX_EPSILON);
}

//==================================================================================
// --- スクリーン内にいるかの判定処理 ---
//==================================================================================
bool Vec2::IsInScreen(const Vector2 &pos)
{
	// スクリーン内にいるかを判定
	if (pos.x < 0 || pos.x > SCREEN_WIDTH
		|| pos.y < 0 || pos.y > SCREEN_HEIGHT)
	{
		return false;
	}
	else
	{
		return true;
	}
}

//==================================================================================
// --- 2次元ベクトルの正規化処理 ---
//==================================================================================
Vector2 Vec2::Normalize(const Vector2 &vec)
{
	float fLength;			// ベクトルの長さ

	// ベクトルの長さを取得
	fLength = Length(vec);

	// ベクトルの長さで正規化
	return Vector2(vec.x / fLength, vec.y / fLength);
}

//==================================================================================
// --- 2次元ベクトルの線形補間処理 ---
//==================================================================================
Vector2 Vec2::Lerp(const Vector2 &start, const Vector2 &end, const float fT)
{
	Vector2 vec;		// 線形補間後のベクトル

	// 2点間の差分を求める
	vec = end - start;

	// 補間後の値を返す
	return start + (vec * fT);
}

//==================================================================================
// --- 2点間の間の取得処理 ---
//==================================================================================
Vector2 Vec2::Middle(const Vector2 &p1, const Vector2 &p2)
{
	// 線形補間で求める
	return Lerp(p1, p2, 0.5f);
}

//==================================================================================
// --- 角度の2次元単位ベクトル取得処理 ---
//==================================================================================
Vector2 Vec2::Direction(const float fAngle)
{
	return Vector2(sinf(fAngle), cosf(fAngle));
}

//==================================================================================
// --- 角度の取得処理 ---
//==================================================================================
float Vec2::Direction(const Vector2 &To, const Vector2 &From)
{
	return atan2f(To.x - From.x, To.y - From.y);
}

//==================================================================================
// --- ランダムな2次元単位ベクトル取得処理 ---
//==================================================================================
Vector2 Vec2::Random(void)
{
	float fAngle = (float)rand() / RAND_MAX;		// ランダムな角度

	return Vector2(sinf(fAngle), cosf(fAngle));
}

//==================================================================================
// --- 範囲内のランダムな2次元ベクトル取得処理 ---
//==================================================================================
Vector2 Vec2::Random(const Vector2 &min, const Vector2 &max)
{
	CRand *pRand = CRand::GetInstance();		// 乱数生成インスタンス

	return Vector2((min.x >= max.x) ? min.x : pRand->Generate(min.x, max.x),
		(min.y >= max.y) ? min.y : pRand->Generate(min.y, max.y));
}

//==================================================================================
// --- 2次元ベクトルの範囲内矯正処理 ---
//==================================================================================
Vector2 Vec2::Clamp(const Vector2 &vec, const Vector2 &min, const Vector2 &max)
{
	Vector2 clamp;		// クランプ後の値

	// 最大値と最小値でクランプした値を代入
	clamp.x = (vec.x < min.x) ? min.x 
		: ((vec.x > max.x) ? max.x : vec.x);
	clamp.y = (vec.y < min.y) ? min.y 
		: ((vec.y > max.y) ? max.y : vec.y);

	return clamp;
}

//==================================================================================
// --- 角度の修正処理 ---
//==================================================================================
Vector2 Vec2::FixedRotation(const Vector2 &rot)
{
	Vector2 fixed;		// 修正後の角度

	// X軸を修正
	fixed.x = (rot.x > D3DX_PI) ? rot.x - D3DX_PI * 2.0f :
		((rot.x <= -D3DX_PI) ? rot.x + D3DX_PI * 2.0f :
			rot.x);

	// Y軸を修正
	fixed.y = (rot.y > D3DX_PI) ? rot.y - D3DX_PI * 2.0f :
		((rot.y <= -D3DX_PI) ? rot.y + D3DX_PI * 2.0f :
			rot.y);

	return fixed;
}

//==================================================================================
// --- 円弧上の座標取得処理 ---
//==================================================================================
Vector2 Vec2::Arc(const float fRadius, const float fRadian, const Vector2 &offset)
{
	Vector2 pos = offset;		// 円弧上の座標

	// 角度と半径から求めた値を加算
	pos.x += sinf(fRadian) * fRadius;
	pos.y += cosf(fRadian) * fRadius;

	return pos;
}

//==================================================================================
// --- 指定した値の代入処理 ---
//==================================================================================
Vector2 &Vec2::Fill(Vector2 &rVec, const float fValue)
{
	// VECTOR2に値を埋める
	rVec = Vector2(fValue, fValue);

	return rVec;
}

//==================================================================================
// --- 指定した値で埋めたVECTOR3取得処理 ---
//==================================================================================
Vector2 Vec2::Fill(const float fValue)
{
	// VECTOR2に値を埋めて、返す
	return Vector2(fValue, fValue);
}

//==================================================================================
// --- 半径から正方形サイズへの変換取得処理 ---
//==================================================================================
Vector2 Vec2::ToSquareSize(const float fRadius)
{
	// 半径から正方形サイズを求めて返す
	return Vector2(fRadius * 2.0f, fRadius * 2.0f);
}

//==================================================================================
// --- ラジアンへの変換処理 ---
//==================================================================================
Vector2 Vec2::ToRadian(const Vector2 &degree, const bool bFixed)
{
	Vector2 radian;		// 変換後の角度

	// ラジアン変換
	radian.x = D3DXToRadian(degree.x);
	radian.y = D3DXToRadian(degree.y);

	// 元から角度が修正されているか確認
	if (bFixed == false)
	{ // 修正されていなければ、角度を修正
		radian = FixedRotation(radian);
	}

	return radian;
}

//==================================================================================
// --- 360°への変換処理 ---
//==================================================================================
Vector2 Vec2::ToDegree(const Vector2 &radian, const bool bFixed)
{
	Vector2 fixedRadian = radian;		// 修正後の角度
	Vector2 degree = radian;			// 変換後の角度

	// 元から角度が修正されているか確認
	if (bFixed == false)
	{ // 修正されていなければ、角度を修正
		fixedRadian = FixedRotation(radian);
	}

	// 360°変換
	degree.x = D3DXToDegree(fixedRadian.x);
	degree.y = D3DXToDegree(fixedRadian.y);

	return degree;
}

//==================================================================================
// --- VECTOR3への変換処理処理 ---
//==================================================================================
Vector3 Vec2::ToVector3(const Vector2 &vec, const float fZ)
{
	return Vector3(vec.x, vec.y, fZ);
}